app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'psikologsyachra@psikolog.com'
 LIMIT 1
SELECT *
FROM `admin`
WHERE `email` = 'psikologsyachra@psikolog.com'
 LIMIT 1
SELECT *
FROM `psikolog`
WHERE `email` = 'psikologsyachra@psikolog.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $modelAdmin = new AdminModel();
        $modelpsikolog = new PsikologModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('email', $email)->first();
        $admin = $modelAdmin->where('email', $email)->first();
        $psikolog = $modelpsikolog->where('email', $email)->first();