app/Controllers/PsikologController.php

    public function coupleCurhat()
    {
        // Proteksi login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil data psikolog berdasarkan spesialisasi
        $data['psikolog'] = $this->psikologModel
            ->where('spesialisasi', 'Couple Curhat')
            ->findAll();
---
SELECT *
FROM `psikolog`
WHERE `spesialisasi` = 'Couple Curhat'

    public function kuyCurhat()
    {
        // Proteksi login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil data psikolog berdasarkan spesialisasi
        $data['psikolog'] = $this->psikologModel
            ->findAll();
---
SELECT *
FROM `psikolog`

    public function paketCurhat()
    {
        // Proteksi login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil data psikolog berdasarkan spesialisasi
        $data['psikolog'] = $this->psikologModel
            ->where('spesialisasi', 'Paket Curhat')
            ->findAll();
---
SELECT *
FROM `psikolog`
WHERE `spesialisasi` = 'Paket Curhat'