app/Controllers/ScheduleController.php

    public function index($id_psikolog)
    {
        // tes dulu
        // dd($id_psikolog);

        $psikologModel = new PsikologModel();
        $jadwalModel   = new JadwalPsikologModel();

        $psikolog = $psikologModel->find($id_psikolog);
---
SELECT *
FROM `psikolog`
WHERE `psikolog`.`id_psikolog` = '2'