app/Models/JadwalPsikologModel.php

SELECT *
FROM `jadwal_psikolog`
WHERE `id_psikolog` = '2'
AND `status` = 'tersedia'
---
    public function getAvailabilityByPsikolog($id_psikolog)
    {
        return $this->where([
            'id_psikolog' => $id_psikolog,
            'status' => 'tersedia'
        ])->findAll();